---
kind: enumMember
id: F:Autodesk.Revit.DB.JoinType.SquareOff
enum: Autodesk.Revit.DB.JoinType
source: html/ca8395f6-d268-9296-5428-65d06fb34970.htm
---
# Autodesk.Revit.DB.JoinType.SquareOff

Square-off Join